Jonny-Le/KW47_keylessEntry/libs/middleware/wireless/XCVR/drv/nb2p4ghz/nxp2p4_xcvr.h
/*
 * Copyright (c) 2015,2018, Freescale Semiconductor, Inc.
 * Copyright 2018-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#ifndef NB2P4_XCVR_H
/* clang-format off */
#define NB2P4_XCVR_H
/* clang-format on */

#include "fsl_device_registers.h"

#if defined(NXP_RADIO_GEN) && (NXP_RADIO_GEN >= 400)
#include "rfmc_ctrl.h"
#else
#include "rsim_ctrl.h"
#endif

#include <stdbool.h>

/*!
 * @addtogroup xcvr_main Radio Configuration Routines
 * @{
 */

/*******************************************************************************
 * Definitions
 *******************************************************************************/
#if !defined(RADIO_IS_GEN_3P5) && !defined(NXP_RADIO_GEN) 
#error "XCVR compilation requires a valid radio generation flag to be defined."
#endif

/* Workaround to fix SDK header names */
#ifndef GEN4PHY
#define GEN4PHY XCVR_2P4GHZ_PHY
#endif

#ifndef RBME
#define RBME D_IP_PLL_NARROWBAND_SYN
#endif

/* Workaround for not exposed DFT register in DBGRAM/DMA */
#if defined(RADIO_IS_GEN_3P5)
#define XCVR_RX_DIG_RXDIG_DFT_IQ_MUX_SEL_MASK    (0xF00U)
#define XCVR_RX_DIG_RXDIG_DFT_IQ_MUX_SEL_SHIFT   (8U)
#define XCVR_RX_DIG_RXDIG_DFT_IQ_MUX_SEL(x) \
    (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_RXDIG_DFT_IQ_MUX_SEL_SHIFT)) & XCVR_RX_DIG_RXDIG_DFT_IQ_MUX_SEL_MASK)
#endif

/* Workaround for not exposed HPMCAL_CTRL register in XCVR_PLL */
#if !defined(HPMCAL_CTRL)

/** Peripheral XCVR_PLL_DIG base pointer */
#define XCVR_PLL_DIG2                             ((XCVR_PLL_DIG2_Type *)XCVR_PLL_DIG_BASE)

/* Workaround for missing Zigbee/802.15.4 interrupt in CM33 */
#if defined(NXP_RADIO_GEN) && (NXP_RADIO_GEN >= 450)
#ifndef RF_Zigbee_IRQn
#define RF_Zigbee_IRQn              53               /**< Radio Frequency 2.4GHz - Zigbee Link Layer interrupt */
#endif
#endif /* defined(RADIO_IS_GEN_4P5) */

/* defining only the first part of the XCVR_PLL_DIG structure to make a version with HPMCAL_CTRL available. Everything
 * else is appended with dummy or deleted */
typedef struct
{
  __IO uint32_t HPM_BUMPdummy;                          /**< PLL HPM Analog Bump Control, offset: 0x0 */
  __IO uint32_t MOD_CTRLdummy;                          /**< PLL Modulation Control, offset: 0x4 */
  __IO uint32_t CHAN_MAPdummy;                          /**< PLL Channel Mapping, offset: 0x8 */
       uint8_t RESERVED_0dummy[4];
  __IO uint32_t CHAN_MAP_EXTdummy;                      /**< PLL Channel Mapping Extended, offset: 0x10 */
       uint8_t RESERVED_1dummy[4];
  __IO uint32_t LOCK_DETECTdummy;                       /**< PLL Lock Detect Control, offset: 0x18 */
  __IO uint32_t HPM_CTRLdummy;                          /**< PLL High Port Modulator Control, offset: 0x1C */
  __IO uint32_t HPMCAL_CTRL;                       /**< PLL High Port Calibration Control, offset: 0x20 */
} XCVR_PLL_DIG2_Type;


/*! @name HPMCAL_CTRL - PLL High Port Calibration Control */
/*! @{ */
#define XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_FACTOR_MASK (0x1FFFU)
#define XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_FACTOR_SHIFT (0U)
/*! HPM_CAL_FACTOR - High Port Modulation Calibration Factor
 */
#define XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_FACTOR(x)                                    \
    (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_FACTOR_SHIFT)) & \
     XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_FACTOR_MASK)
#define XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_BUMPED_MASK (0x2000U)
#define XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_BUMPED_SHIFT (13U)
/*! HPM_CAL_BUMPED - HPM_CAL_BUMPED
 */
#define XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_BUMPED(x)                                    \
    (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_BUMPED_SHIFT)) & \
     XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_BUMPED_MASK)
#define XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_COUNT_SCALE_MASK (0x4000U)
#define XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_COUNT_SCALE_SHIFT (14U)
/*! HPM_CAL_COUNT_SCALE - HPM_CAL_COUNT_SCALE
 */
#define XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_COUNT_SCALE(x)                                    \
    (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_COUNT_SCALE_SHIFT)) & \
     XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_COUNT_SCALE_MASK)
#define XCVR_PLL_DIG2_HPMCAL_CTRL_HP_CAL_DISABLE_MASK (0x8000U)
#define XCVR_PLL_DIG2_HPMCAL_CTRL_HP_CAL_DISABLE_SHIFT (15U)
/*! HP_CAL_DISABLE - Disable HPM Manual Calibration
 */
#define XCVR_PLL_DIG2_HPMCAL_CTRL_HP_CAL_DISABLE(x)                                    \
    (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG2_HPMCAL_CTRL_HP_CAL_DISABLE_SHIFT)) & \
     XCVR_PLL_DIG2_HPMCAL_CTRL_HP_CAL_DISABLE_MASK)
#define XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_FACTOR_MANUAL_MASK (0x1FFF0000U)
#define XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_FACTOR_MANUAL_SHIFT (16U)
/*! HPM_CAL_FACTOR_MANUAL - Manual HPM Calibration Factor
 */
#define XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_FACTOR_MANUAL(x)                                    \
    (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_FACTOR_MANUAL_SHIFT)) & \
     XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_FACTOR_MANUAL_MASK)
#define XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_SKIP_MASK (0x20000000U)
#define XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_SKIP_SHIFT (29U)
/*! HPM_CAL_SKIP - HPM_CAL_SKIP
 */
#define XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_SKIP(x)                                    \
    (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_SKIP_SHIFT)) & \
     XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_SKIP_MASK)
#define XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_ARRAY_SIZE_MASK (0x40000000U)
#define XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_ARRAY_SIZE_SHIFT (30U)
/*! HPM_CAL_ARRAY_SIZE - High Port Modulation Calibration Array Size
 *  0b0..128
 *  0b1..256
 */
#define XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_ARRAY_SIZE(x)                                    \
    (((uint32_t)(((uint32_t)(x)) << XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_ARRAY_SIZE_SHIFT)) & \
     XCVR_PLL_DIG2_HPMCAL_CTRL_HPM_CAL_ARRAY_SIZE_MASK)
/*! @} */

#endif /* !defined(HPMCAL_CTRL) */

#ifndef IQMC_TRIM_DOWNLOAD_SUPPORT
#if defined(NXP_RADIO_GEN) && (NXP_RADIO_GEN==470)
#define IQMC_TRIM_DOWNLOAD_SUPPORT (1)
#else 
#define IQMC_TRIM_DOWNLOAD_SUPPORT (0)
#endif      
#endif /* ifndef IQMC_TRIM_DOWNLOAD_SUPPORT */

/* Error check compile flags */
#if !defined(RF_OSC_26MHZ)
#define RF_OSC_26MHZ (0)
#endif

#if !((RF_OSC_26MHZ == 1U) || (RF_OSC_26MHZ == 0U))
/* Code requires this flag to strictly be 0 or 1 */
#error "Invalid flag setting for RF OSC 26MHz selection. Only 0 or 1 is permitted."
#endif /* RF_OSC_26MHZ > 1 */
/**************************************/

#define NULLPTR ((void *)(0x0))  /* MISRA safe definition for NULL */

 /* Default RF OSC definition. Allows for compile time clock frequency definition */
#ifdef CLOCK_MAIN

#else
#if RF_OSC_26MHZ == 1
#define CLOCK_MAIN (EXT_CLK_26_MHZ) /* See ext_clock_config_t for this value */
#else
#define CLOCK_MAIN (EXT_CLK_32_MHZ) /* See ext_clock_config_t for this value */
#endif /* RF_OSC_26MHZ == 1 */
#endif /* CLOCK_MAIN */

#ifndef FPGA_TARGET /* make sure the FPGA_TARGET flag is defined to support XCVR compilation */
#define FPGA_TARGET (0)
#endif /* FPGA_TARGET */

#define B0(x)   (((uint32_t)(((uint32_t)(x)) << 0)) & 0xFFU)
#define B1(x)   (((uint32_t)(((uint32_t)(x)) << 8)) & 0xFF00U)
#define B2(x)   (((uint32_t)(((uint32_t)(x)) << 16)) & 0xFF0000U)
#define B3(x)   (((uint32_t)(((uint32_t)(x)) << 24)) & 0xFF000000U)
#define TSM_TX_HI(x)   (((uint32_t)(((uint32_t)(x)) << 0)) & 0xFFU)
#define TSM_TX_LO(x)   (((uint32_t)(((uint32_t)(x)) << 8)) & 0xFF00U)
#define TSM_RX_HI(x)   (((uint32_t)(((uint32_t)(x)) << 16)) & 0xFF0000U)
#define TSM_RX_LO(x)   (((uint32_t)(((uint32_t)(x)) << 24)) & 0xFF000000U)

/* TSM and LL related delay values */
#if defined(RADIO_IS_GEN_3P5)
#define TX_RX_ON_DELinit       (0x00009686UL) /* TX_ON_DELAY defined differently than prior radios, must be 150usec. */
#define TX_RX_SYNTH_init_A0    (0x00002318UL) /* TX_RX_SYNTH initialization for KW37 A0 silicon */
#define TX_RX_SYNTH_init_B0    (0x00006918UL) /* TX_RX_SYNTH initialization for KW37 B0 silicon */

#define TX_PATH_DELAY_2MBPS    (0x1U)       /*!<  Gen 3.5 - TX Path delay for bits from controller to antenna for 1Mbps */
#define TX_PATH_DELAY_1MBPS    (0x2U)       /*!<  Gen 3.5 - TX Path delay for bits from controller to antenna for 2Mbps */
#define TX_PATH_DELAY_S2_CODED (0x2U) /*!<  Gen 3.5 - TX Path delay for bits from controller to antenna for S2 coded \
                                       */
#define TX_PATH_DELAY_S8_CODED (0x2U) /*!<  Gen 3.5 - TX Path delay for bits from controller to antenna for S8 coded \
                                       */

