Jonny-Le/KW47_keylessEntry/libs/middleware/wireless/XCVR/drv/nb2p4ghz/nxp2p4_xcvr.h
#define RX_PATH_DELAY_2MBPS    (0x7U)       /*!<  Gen 3.5 - RX Path delay for last bit from antenna to controller for 1Mbps */
#define RX_PATH_DELAY_1MBPS    (0xEU)       /*!<  Gen 3.5 - RX Path delay for last bit from antenna to controller for 2Mbps */
#define RX_PATH_DELAY_S2_CODED \
    (0x10U) /*!<  Gen 3.5 - RX Path delay for last bit from antenna to controller for S2 coded */
#define RX_PATH_DELAY_S8_CODED \
    (0x10U) /*!<  Gen 3.5 - RX Path delay for last bit from antenna to controller for S8 coded */
#else
#if defined(NXP_RADIO_GEN) && (NXP_RADIO_GEN == 400)
#define TX_RX_ON_DELinit \
    (0x00009256UL) /* TX_ON_DELAY defined differently than prior radios, must be 86usec. Used for Mindtree BLE LL */
#if defined(FPGA_TARGET) && (FPGA_TARGET == 1)
#define TX_RX_SYNTH_init       (0x00007056UL) /* HDI MODE tuning */
#else
#define TX_RX_SYNTH_init       (0x0000745BUL) /* Used for Mindtree BLE LL */
#endif /* FPGA_TARGET */

#define TX_PATH_DELAY_2MBPS    (0x1U)       /*!<  Gen 4.0 - TX Path delay for bits from controller to antenna for 1Mbps */
#define TX_PATH_DELAY_1MBPS    (0x2U)       /*!<  Gen 4.0 - TX Path delay for bits from controller to antenna for 2Mbps */
#define TX_PATH_DELAY_S2_CODED (0x2U) /*!<  Gen 4.0 - TX Path delay for bits from controller to antenna for S2 coded \
                                       */
#define TX_PATH_DELAY_S8_CODED (0x2U) /*!<  Gen 4.0 - TX Path delay for bits from controller to antenna for S8 coded \
                                       */

#define RX_PATH_DELAY_2MBPS    (0x7U)       /*!<  Gen 4.0 - RX Path delay for last bit from antenna to controller for 1Mbps */
#define RX_PATH_DELAY_1MBPS    (0xEU)       /*!<  Gen 4.0 - RX Path delay for last bit from antenna to controller for 2Mbps */
#define RX_PATH_DELAY_S2_CODED \
    (0x10U) /*!<  Gen 4.0 - RX Path delay for last bit from antenna to controller for S2 coded */
#define RX_PATH_DELAY_S8_CODED \
    (0x10U)                        /*!<  Gen 4.0 - RX Path delay for last bit from antenna to controller for S8 coded */
#else /* defined (RADIO_IS_GEN_4P5) */
#define TX_PATH_DELAY_2MBPS    (0x1U)       /*!<  Gen 4.5 - TX Path delay for bits from controller to antenna for 1Mbps */
#define TX_PATH_DELAY_1MBPS    (0x1U)       /*!<  Gen 4.5 - TX Path delay for bits from controller to antenna for 2Mbps */
#define TX_PATH_DELAY_S2_CODED (0x1U) /*!<  Gen 4.5 - TX Path delay for bits from controller to antenna for S2 coded \
                                       */
#define TX_PATH_DELAY_S8_CODED (0x1U) /*!<  Gen 4.5 - TX Path delay for bits from controller to antenna for S8 coded \
                                       */

#define RX_PATH_DELAY_2MBPS    (0x7U)       /*!<  Gen 4.5 - RX Path delay for last bit from antenna to controller for 1Mbps */
#define RX_PATH_DELAY_1MBPS    (0xEU)       /*!<  Gen 4.5 - RX Path delay for last bit from antenna to controller for 2Mbps */
#define RX_PATH_DELAY_S2_CODED \
    (0x12U) /*!<  Gen 4.5 - RX Path delay for last bit from antenna to controller for S2 coded */
#define RX_PATH_DELAY_S8_CODED \
    (0x17U) /*!<  Gen 4.5 - RX Path delay for last bit from antenna to controller for S8 coded */

#endif /* defined(RADIO_IS_GEN_4P0) */

#endif /* defined(RADIO_IS_GEN_3P5) */

#define PA_SETTLING_TIME       (0x4U)       /*!< Time for PA to settle after ramp up and before on-the-air time. */
#define PHY_EN_DELAY           (28U)        /* Additional delay to add to PHY_EN signal to account for DC settling after RX_WU */
#ifdef gXcvrAddTxOffset_d /* allow higher level software to control whether offset is added or not */
#define tx_ofst_usec           (36U)        /* offset value for TX warmup to extend TSM sequence on A0 KW37 silicon for Bluetooth LE */
#else
#define tx_ofst_usec           (0U)         /* zero offset value for TX warmup for GENFSK only use cases */
#endif /* ifdef gXcvrAddTxOffset_d */
#define RX_WD_TIME_TGT         (0x8U)       /*!< Mid point value for the RX warmdown time register */
#define TX_WD_TIME_TGT         (0x8U)       /*!< Mid point value for the TX warmdown time register */


#ifndef XCVR_DAC_TRIM_RETRY_COUNT
#define XCVR_DAC_TRIM_RETRY_COUNT   (1U)     /*!< Default retry count for DCOC DAC trim process to 1 */
#endif

#ifndef XTAL_TEMP_COMP_LUT_SIZE
#define XTAL_TEMP_COMP_LUT_SIZE \
    (17) /*!< Default LUT size for temp compensation of XTAL trim (signed, but must be positive) */
#endif

#if defined(NXP_RADIO_GEN) && (NXP_RADIO_GEN >= 470)
/* Packet RAM to IPS register descriptor access macros */
/* Address field for the Packet RAM to IPS register descriptor */
#define PR2IPS_ADDR_MASK       (0x00FFFFFFU)
#define PR2IPS_ADDR_SHIFT      (0U)
#define PR2IPS_ADDR(x)         (((uint32_t)(((uint32_t)(x)) << PR2IPS_ADDR_SHIFT)) & PR2IPS_ADDR_MASK)
/* Count field for the Packet RAM to IPS register descriptor */
#define PR2IPS_COUNT_MASK       (0x3F000000U)
#define PR2IPS_COUNT_SHIFT      (24U)
#define PR2IPS_COUNT(x)                                    \
    (((uint32_t)(((uint32_t)(x)) << PR2IPS_COUNT_SHIFT)) & \
     PR2IPS_COUNT_MASK) /* Address field for the Packet RAM to IPS register descriptor */
/* Type field for the Packet RAM to IPS register descriptor */
#define PR2IPS_TYPE_MASK       (0xC0000000U)
#define PR2IPS_TYPE_SHIFT      (30U)
#define PR2IPS_TYPE(x)         (((uint32_t)(((uint32_t)(x)) << PR2IPS_TYPE_SHIFT)) & PR2IPS_TYPE_MASK)

#define PR2IPS_DESCRIPTOR(type, reg_count, addr) PR2IPS_TYPE(type) | PR2IPS_COUNT(reg_count) | PR2IPS_ADDR(addr)
#endif /* defined(NXP_RADIO_GEN) && (NXP_RADIO_GEN >= 470) */


/*! @brief Error codes for the XCVR driver. */
typedef enum
{
  gXcvrSuccess_c = 0,
  gXcvrInvalidParameters_c,
  gXcvrUnsupportedOperation_c,
  gXcvrTrimFailure_c,
  gXcvrInvalidConfiguration_c,
  gXcvrConfigurationFailure_c,
} xcvrStatus_t;

/*! @brief  Clock configuration enum type. */
typedef enum
{
  EXT_CLK_32_MHZ = 0,
  EXT_CLK_26_MHZ = 1,
} ext_clock_config_t;

/*! @brief  Radio operating mode setting types. */
typedef enum
{
  BLE_MODE = 0,

#if defined(NXP_RADIO_GEN) && (NXP_RADIO_GEN >= 400)
    OQPSK_802P15P4 = 1,
#else
    RESERVED1_MODE = 1, /*!< Reserved  */
#endif /* defined(RADIO_IS_GEN_4P5) */
  RESERVED2_MODE = 2, /*!< Reserved  */

  /* BT=0.5, h=** */
  GFSK_BT_0p5_h_0p5  = 3, /*!< BT=0.5, h=0.5  */
  GFSK_BT_0p5_h_0p32 = 4, /*!< BT=0.5, h=0.32 */
  GFSK_BT_0p5_h_0p7  = 5, /*!< BT=0.5, h=0.7  */
  GFSK_BT_0p5_h_1p0  = 6, /*!< BT=0.5, h=1.0  */

#if defined(NXP_RADIO_GEN) && (NXP_RADIO_GEN >= 400)
  /* BT=** h=0.5 */
  GFSK_BT_0p3_h_0p5  = 7, /*!< BT=0.3, h=0.5  */
  GFSK_BT_0p7_h_0p5  = 8, /*!< BT=0.7, h=0.5  */
#else
  RESERVED3_MODE  = 7, /*!< Reserved  */
  RESERVED4_MODE  = 8, /*!< Reserved  */
#endif /* defined(RADIO_IS_GEN_4P0) */

  MSK = 9,
  BLE_LR = 10,
  FSK_H_0p5 = 11,
#if defined(NXP_RADIO_GEN) && (NXP_RADIO_GEN >= 400)
  GFSK_BT_1p0_h_0p5  = 12, /*!< BT=1.0, h=0.5  */
  GFSK_BT_2p0_h_0p5 = 13, /*!< BT=2.0, h=0.32 */
#else
  RESERVED5_MODE  = 12, /*!< Reserved  */
  RESERVED6_MODE  = 13, /*!< Reserved  */
#endif /* defined(RADIO_IS_GEN_4P5) */
  NUM_RADIO_MODES = 14,
} radio_mode_t;

/*! @brief  Coding rate selections. */
typedef enum
{
    BLE_UNCODED = 0, /*!< Bluetooth LE Uncoded */
    BLE_CODED_S2 = 1, /*!< Bluetooth LE Long Range  S=2 */
    BLE_CODED_S8 = 2, /*!< Bluetooth LE Long Range  S=8 */
    ANT_UNCODED = 3, /*!< ANT emulation */
    CODING_UNASSIGNED = 4, /* Unassigned Data Rate. Must match bit assignment in BITRATE field */
} coding_t;

/*! @brief  Data rate selections. */
typedef enum
{
    DR_1MBPS = 0, /*!< 1Mbps Data Rate. Must match bit assignment in BITRATE field */
    DR_500KBPS = 1, /*!< 500Kbps Data Rate. Must match bit assignment in BITRATE field */
    DR_250KBPS = 2, /*!< 250Kbps Data Rate. Must match bit assignment in BITRATE field */
    DR_2MBPS = 3, /*!< 2Mbps Data Rate. Must match bit assignment in BITRATE field */
    DR_UNASSIGNED = 4, /* Unassigned Data Rate. Must match bit assignment in BITRATE field */
} data_rate_t;

/*! @brief  Link layer types. */
typedef enum
{
    BLE_LL = 0, /*!< Bluetooth Low Energy Link Layer. Must match bit assignment in RADIO1_IRQ_SEL */
#if defined(NXP_RADIO_GEN) && (NXP_RADIO_GEN >= 450)
    ZIGBEE_LL = 1, /*!< 802.15.4/Zigbee Link Layer */
#else
    RESERVED1_LL = 1, /*!< Reserved */
#endif /* defined(RADIO_IS_GEN_4P5) */
    RESERVED2_LL = 2, /*!< Reserved */
    GENFSK_LL = 3, /*!< Generic FSK Link Layer. Must match bit assignment in RADIO1_IRQ_SEL */
    UNASSIGNED_LL = 4, /*!< No Link Layer Assigned.  Must match bit assignment in RADIO1_IRQ_SEL */
} link_layer_t;

/*! @brief  Control settings for Fast Antenna Diversity */
typedef enum
{
  NONE = 0,
  FAD_ENABLED = 1,
  LPPS_ENABLED = 2
} FAD_LPPS_CTRL_T;

/*! @brief  Initialization or mode change selection for config routine. */
typedef enum
{
  XCVR_MODE_CHANGE = 0,
  XCVR_FIRST_INIT = 1,
} XCVR_INIT_MODE_CHG_T;

/*! @brief  ACTIVE_LL field settings. */
typedef enum
{
    XCVR_ACTIVE_LL_BTLE = 0,         /*!<  BTLE Link Layer active. */
#if defined(NXP_RADIO_GEN) && (NXP_RADIO_GEN >= 450)
    XCVR_ACTIVE_LL_ZIGBEE_LL = 1,    /*!< 802.15.4/Zigbee Link Layer active */
#else
    XCVR_ACTIVE_LL_RESERVED = 1,     /*!< Reserved, do not use. */
#endif /* defined(RADIO_IS_GEN_4P5) */
    XCVR_ACTIVE_LL_GENFSK = 2,       /*!<  Generic FSK Link Layer active. */
    XCVR_ACTIVE_LL_ALL_DISABLED = 3, /*!<  Disable all Link Layers, none active. */
    XCVR_ACTIVE_LL_MAX = 4           /*!<  Error. */
}   XCVR_ACTIVE_LL_SEL_T;

/*! @brief  BAND_SELECT field settings. */
typedef enum
{
    XCVR_BAND_SEL_BTLE = 0,          /*!<  BTLE normal band selected in PLL. */
    XCVR_BAND_SEL_BTLE_IN_MBAN = 1,  /*!<  BTLE in MBAN band selected in PLL. */
    XCVR_BAND_SEL_BTLE_OVLP_MBAN = 2,/*!<  BTLE overlap MBAN band selected in PLL. */
    XCVR_BAND_SEL_RESERVED1 = 3,     /*!<  Reserved band selection */
#if defined(NXP_RADIO_GEN) && (NXP_RADIO_GEN >= 450)
    XCVR_BAND_SEL_802_15_4_ISM = 4,  /*!<  802.15.4 ISM band selection */
#else
    XCVR_BAND_SEL_RESERVED2 = 4,     /*!<  Reserved band selection */
#endif /* defined(RADIO_IS_GEN_4P5) */
    XCVR_BAND_SEL_802_15_4_J = 5,    /*!<  802.15.4jband selection */
    XCVR_BAND_SEL_DFT = 6,           /*!<  DFT band selection */
    XCVR_BAND_SEL_GENERIC = 7,       /*!<  Generic band selection */
    XCVR_BAND_SEL_MAX = 8            /*!<  Error. */
}   XCVR_BAND_SEL_T;

/*! @brief  RADIO_VER field settings. */
typedef enum
{
    XCVR_RADIO_GEN_2P0 = 0xBU,         /*!<  2.4GHz Radio 2.0 . */
    XCVR_RADIO_GEN_2P1 = 0x8U,         /*!<  2.4GHz Radio 2.1 . */
    XCVR_RADIO_GEN_3P0 = 0x4U,         /*!<  2.4GHz Radio 3.0 . */
    XCVR_RADIO_GEN_3P1 = 0x5U,         /*!<  2.4GHz Radio 3.1 . */
    XCVR_RADIO_GEN_3P5 = 0xCU,         /*!<  2.4GHz Radio 3.5 . */
    XCVR_RADIO_GEN_3P5_B0 = 0x6U,      /*!<  2.4GHz Radio 3.5, B0 silicon revision. */
    XCVR_RADIO_GEN_4P0 = 0x4000U,      /*!<  2.4GHz Radio 4.0 . */
    XCVR_RADIO_GEN_4P5 = 0x4500U,      /*!<  2.4GHz Radio 4.5 . */
    XCVR_RADIO_GEN_INVALID = 0xFFFFU   /*!<  Error. */
}   XCVR_RADIO_GEN_T;

/*! @brief  Packet RAM selection (TX or RX) enum type for PR2IPS usage. */
typedef enum
{
  TX_PKT_RAM_SEL = 0U, /*!<  Select the TX PKT_RAM bank for usage for Fast Peripheral Reg upload/download. */
  RX_PKT_RAM_SEL = 1U, /*!<  Select the RX PKT_RAM bank for usage for Fast Peripheral Reg upload/download. */
} PKT_RAM_BANK_SEL_T;

/*! @brief  Packet RAM 2 IPS transfer type field. */
typedef enum
{
  PR2IPS_END_OF_DESCRIP = 0U, /*!<  Denotes the last PR2IPS descriptor in a sequence. */
  PR2IPS_SINGLE_XFER = 1U,       /*!<  Selects a single transfer in the PR2IPS descriptor. */
  PR2IPS_BURST_XFER = 2U         /*!<  Selects a burst transfer in the PR2IPS descriptor. */
} PR2IPS_XFER_T;

/*! @brief Current configuration of the radio. */
typedef struct
{
    radio_mode_t radio_mode;
    data_rate_t data_rate;
    data_rate_t alt_data_rate;
    coding_t coding_mode;
} xcvr_currConfig_t;

/*!
 * @brief XCVR RX_DIG channel filter coefficient storage
 * Storage of the c
oefficients varies from 6 bits to 10 bits so all use int16_t for storage.
 */
typedef struct
{
    uint32_t dummy;
} xcvr_rx_chf_coeffs_t;

/*!
 * @brief XCVR DCOC DAC trim register value storage
 * Storage of the entire 32 bit register contents for all DCOC DAC trim registers.
 */
typedef struct
{
    uint32_t dcoc_bba_step_reg; /*!< XCVR_RX_DIG->DCOC_BBA_STEP contents */
    uint32_t dcoc_tza_step_0_reg; /*!< XCVR_RX_DIG->DCOC_TZA_STEP_0 contents */
    uint32_t dcoc_tza_step_1_reg; /*!< XCVR_RX_DIG->DCOC_TZA_STEP_1 contents */
    uint32_t dcoc_tza_step_2_reg; /*!< XCVR_RX_DIG->DCOC_TZA_STEP_2 contents */
    uint32_t dcoc_tza_step_3_reg; /*!< XCVR_RX_DIG->DCOC_TZA_STEP_3 contents */
    uint32_t dcoc_tza_step_4_reg; /*!< XCVR_RX_DIG->DCOC_TZA_STEP_4 contents */
    uint32_t dcoc_tza_step_5_reg; /*!< XCVR_RX_DIG->DCOC_TZA_STEP_5 contents */
    uint32_t dcoc_tza_step_6_reg; /*!< XCVR_RX_DIG->DCOC_TZA_STEP_6 contents */
    uint32_t dcoc_tza_step_7_reg; /*!< XCVR_RX_DIG->DCOC_TZA_STEP_7 contents */
    uint32_t dcoc_tza_step_8_reg; /*!< XCVR_RX_DIG->DCOC_TZA_STEP_8 contents */
    uint32_t dcoc_tza_step_9_reg; /*!< XCVR_RX_DIG->DCOC_TZA_STEP_9 contents */
    uint32_t dcoc_tza_step_10_reg; /*!< XCVR_RX_DIG->DCOC_TZA_STEP_10 contents */
    uint32_t dcoc_dac_init_reg; /*!< XCVR_RX_DIG->DCOC_DAC_INIT contents */
} xcvr_DcocDacTrim_t;

/*!
 * @brief RBME CRC configuration register value storage
 * Storage of the CRC register contents for customizing CRC settings.
 */
typedef struct
{
    uint32_t crcw_cfg;          /*!< RBME->CRCW_CFG contents */
    uint32_t crcw_cfg3;         /*!< RBME->CRCW_CFG3 contents */
    uint32_t crc_init;          /*!< RBME->CRC_INIT contents */
    uint32_t crc_poly;          /*!< RBME->CRC_POLY contents */
} rbme_crc_config_t;

/*!
 * @brief RBME Whitener configuration register value storage
 * Storage of the Whitener register contents for customizing Whitener settings.
 */
typedef struct
{
    uint32_t whiten_cfg;        /*!< RBME->WHITEN_CFG contents */
    uint32_t whiten_poly;       /*!< RBME->WHITEN_POLY contents */
    uint32_t whiten_sz_thr;     /*!< RBME->WHITEN_SZ_THR contents */
    uint32_t wht_cfg;           /*!< RBME->WHT_CFG contents */
} rbme_whiten_config_t;

/*!
 * @brief XCVR PLL channel configuration structure
 * This structure is used to store the integer portion, numerator, and denominator values for setting a PLL channel.
 */
typedef struct
{
    uint32_t intpart;
    uint32_t numerator;
} xcvr_pllChannel_t;

/*!
 * @brief XCVR XTAL temp compensation configuration structure
 * This structure is used to store the table for temperature compensation of the XTAL trim.
 */
typedef struct
{
    int16_t min_temp_degc;        /*!< The temperature corresponding to the first LUT entry, in deg C */
    int16_t max_temp_degc;        /*!< The temperature corresponding to the last LUT entry, in deg C */
    uint8_t trim_below_min_temp; /*!< The CDAC value to use when temp is below the min temp for the LUT */
    uint8_t trim_above_max_temp; /*!< The CDAC value to use when temp is above the max temp for the LUT */
    int8_t temp_step_degc;      /*!< The temperature step between each LUT entry, in deg C */
    uint8_t xtal_trim_lut[XTAL_TEMP_COMP_LUT_SIZE]; /*!< The CDAC values for the LUT, stored in ascending temperature,
                                                       from min to max with temp_step increments */
} xcvr_temp_comp_lut_t;


/**
 * @brief 32-bit floating-point type definition.
 */
#ifndef float32_t
typedef float float32_t;
#endif /* float32_t */

/**
 * @brief 64-bit floating-point type definition.
 */
#ifndef float64_t
typedef double float64_t;
#endif /* float64_t */

/* This include must be down here rather than up top due to references to structs defined above */
#include "nxp_xcvr_mode_config.h"
/* Packet RAM pointer function macro - References enums from above */
#define GET_PKT_RAM_PTR(r, ofst) \
    ((r) == TX_PKT_RAM_SEL ? (&(TX_PACKET_RAM->PACKET_RAM[(ofst)])) : (&(RX_PACKET_RAM->PACKET_RAM[(ofst)])))

/* These exported values only apply to Gen 3.5 and Gen 4.0 */
#if defined(NXP_RADIO_GEN) && (NXP_RADIO_GEN <= 400)
/* Expose TX_RX_ON_DELAY and SYNTH_DELAY for BLE LL to access for setting registers appropriately */
extern const uint16_t tx_rx_on_delay;
extern uint16_t tx_rx_synth_delay; /* Not constant, allows for A0/B0 KW37 support */
#endif /* !defined(RADIO_IS_GEN_4P5) */


/* Asembly NOP function encapsulation */
static inline void ASM_NOP(void)
{
    __asm("nop");
};


