Jonny-Le/KW47_keylessEntry/libs/middleware/wireless/XCVR/drv/nb2p4ghz/nxp2p4_xcvr.h
/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Initializes an XCVR instance.
 *
 * This function initializes the XCVR module according to the configuration structure settings. This the only function
 * call required to start up the XCVR in most situations. It includes a DCOC DAC trim step that is left out in the
 * ::XCVR_InitNoDacTrim() version.
 *
 * @param[in] xcvr_config  Pointer to a pointer to the complete radio settings structure.
 * @param[in] rbme_config  Pointer to a pointer to the RBME settings structure for coding, CRC, whitening setup.
 * @return Status of the call.
 * @note This function encompasses the ::XCVR_RadioStartup(() and ::XCVR_RadioRegSetup() and
 * XCVR_CalculateDcocDacTrims() functions.
 */
xcvrStatus_t XCVR_Init(const xcvr_config_t **xcvr_config, const xcvr_coding_config_t **rbme_config);

/*!
 * @brief Initializes an XCVR instance but omits DCOC DAC trim process.
 *
 * This function initializes the XCVR module according to the configuration structure settings. This function call must
 * be combined with the XCVR_SetDcocDacTrims() function to properly start up the XCVR. This allows a stored set of DCOC
 * DAC trims to be used rather than running the trim process during every startup.
 *
 * @param[in] xcvr_config  Pointer to a pointer to the complete radio settings structure.
 * @param[in] rbme_config  Pointer to a pointer to the RBME settings structure for coding, CRC, whitening setup.
 * @return Status of the call.
 * @note This function encompasses everything in the ::XCVR_Init() function but omits the call to
 * XCVR_CalculateDcocDacTrims().
 */
xcvrStatus_t XCVR_InitNoDacTrim(const xcvr_config_t **xcvr_config, const xcvr_coding_config_t **rbme_config);

/*!
 * @brief Deinitializes an XCVR instance.
 *
 * This function gates the XCVR module clock and sets all registers to their reset values.
 *
 */
void XCVR_Deinit(void);

/*!
 * @brief Performs all register setup for XCVR initialization or mode change.
 *
 * This function sets up all of the registers in the XCVR module with user-defined settings.
 *
 * @param[in] xcvr_config  Pointer to a pointer to the full XCVR settings structure.
 * @return Status of the call.
 */
xcvrStatus_t XCVR_RadioRegSetup(const xcvr_config_t ** xcvr_config);

/*!
 * @brief Initializes an XCVR instance.
 *
 * This function initializes the XCVR module with user-defined settings.
 *
 * @param[in] xcvr_config  Pointer to a pointer to the complete radio settings structure.
 * @param[in] rbme_config  Pointer to a pointer to the complete RBME settings structure.
 * @param[in]  first_init Indicates whether the call is to initialize (== XCVR_FIRST_INIT) or the call is to perform a
 * mode change (== XCVR_MODE_CHANGE)
 * @return Status of the call.
 */
xcvrStatus_t XCVR_Configure(const xcvr_config_t ** xcvr_config,
                                const xcvr_coding_config_t ** rbme_config,
                                XCVR_INIT_MODE_CHG_T first_init);

/*!
 * @brief Initializes the RBME block.
 *
 * This function initializes the RBME module with user-defined settings to configure coding, CRC, whitening, etc.
 *
 * @param[in] rbme  Pointer to a pointer to the RBME settings structure for coding, CRC, whitening setup.
 * @return Status of the call.
 */
xcvrStatus_t XCVR_RBME_Configure(const xcvr_coding_config_t ** rbme);

/*!
 * @brief Startup the radio.
 *
 * This function brings the radio into RUN mode and enables the radio clocks.
 *
 */
void XCVR_RadioStartup(void);

/*!
 * @brief Set XCVR register to reset value.
 *
 * This function set XCVR registers to their reset values.
 *
 */
void XCVR_Reset(void);

/*!
 * @brief Change the operating mode of the radio.
 *
 * This function changes the XCVR to a new radio operating mode.
 *
 * @param[in] xcvr_config  Pointer to a pointer to the complete XCVR settings structure.
 * @param[in] rbme_config  Pointer to a pointer to the complete RBME settings structure.
 * @return Status of the call.
 */
xcvrStatus_t XCVR_ChangeMode(const xcvr_config_t **xcvr_config, const xcvr_coding_config_t **rbme_config);

/*!
 * @brief Get the current configuration of the RBME CRC and Whitening.
 *
 * This function fetches the current configuration of the CRC and Whitening registers in the RBME
 *
 * @param[inout] crc_config  Pointer to a structure to be updated with the CRC configurations. NULLPTR if not fetching
 * CRC settings.
 * @param[inout] whiten_config  Pointer to a structure to be updated with the Whitener configurations. NULLPTR if not
 * fetching Whitener settings.
 * @note This API will return meaningless results if called before the radio and RBME are initialized.
 */
void XCVR_GetCRCWConfig(rbme_crc_config_t * crc_config, rbme_whiten_config_t * whiten_config );

/*!
 * @brief Sets the  configuration of the RBME CRC and Whitening.
 *
 * This function sets the register configuration of the CRC and Whitening registers in the RBME
 *
 * @param[inout] crc_config  Pointer to a structure containing the CRC configurations. NULLPTR if not setting CRC
 * settings.
 * @param[inout] whiten_config  Pointer to a structure containing the Whitener configurations. NULLPTR if not setting
 * Whitener settings.
 * @note This API will return meaningless results if called before the radio and RBME are initialized.
 */
void XCVR_SetCRCWConfig(const rbme_crc_config_t * crc_config, const rbme_whiten_config_t * whiten_config );


/*!
 * @brief Enable Narrowband RSSI measurement.
 *
 * This function enables the narrowband RSSI measurement
 *
 * @param IIRnbEnable If set to true, causes the NB RSSI to be enabled, false == disabled.
 */
void XCVR_EnaNBRSSIMeas(bool IIRnbEnable);


#if defined(RADIO_IS_GEN_3P5) /* Gen 4 and later radios don't include DAC trims */
/*!
 * @brief Change the mapping of the radio IRQs.
 *
 * This function changes the mapping of the radio LL IRQ signals to the 2.4G Radio INT0 and 2.4G Radio INT1 lines.
 *
 * @param[in] irq0_mapping  The LL which should be mapped to the INT0 line.
 * @param[in] irq1_mapping  The LL which should be mapped to the INT1 line.
 * @return Status of the mapping request.
 * @note The radio_mode_t parameters map to ::link_layer_t selections for the LL which is connected to the INT line.
 * @warning
 *  The same LL must NOT be mapped to both INT lines.
 */
xcvrStatus_t XCVR_SetIRQMapping(radio_mode_t irq0_mapping, radio_mode_t irq1_mapping);

/*!
 * @brief Get the mapping of the one of the radio IRQs.
 *
 * This function reads the setting for the mapping of one of the radio LL IRQ signals to the 2.4G Radio INT0 and 2.4G
 * Radio INT1 lines.
 *
 * @param[in] int_num  The number, 0 or 1, of the INT line to fetched.
 * @return The mapping setting of the specified line.
 * @note Any value passed into this routine other than 0 will be treated as a 1.
 */
link_layer_t XCVR_GetIRQMapping(uint8_t int_num);
#endif /* defined(RADIO_IS_GEN_3P5)  */ /* Gen 4 and later radios don't include DAC trims */

/*!
 * @brief Get the current configuration of the XCVR.
 *
 * This function fetches the current configuration (radio mode and radio data rate) of the XCVR to allow LL to properly
 * config data rates, etc
 *
 * @param[inout] curr_config  Pointer to a structure to be updated with the current mode and data rate.
 *
 * @return The status of the request, success or invalid parameter (null pointer).
 *
 * @note This API will return meaningless results if called before the radio is initialized.
 */
xcvrStatus_t XCVR_GetCurrentConfig(xcvr_currConfig_t * curr_config);

/*!
 * @brief Controls setting the active link layer.
 *
 * This function enables the upper layers set which link layer (BTLE or GENFSK) should be made active next.
 *
 * @param[in] active_ll  The link layer to be selected.
 *
 * @return The status of the change.
 *
 * @note The caller is responsible for ensuring that the link layer that is active has no ongoing transactions and
 *  is in the idle state before switching.
 */
xcvrStatus_t XCVR_SetActiveLL(XCVR_ACTIVE_LL_SEL_T active_ll);


/*!
 * @brief Controls fetching the current active link layer.
 *
 * This function enables the upper layers get which link layer (BTLE or GENFSK) is currently active.
 *
 * @return The active link layer.
 */
XCVR_ACTIVE_LL_SEL_T  XCVR_GetActiveLL(void);

/*!
 * @brief Controls setting the PLL band selection.
 *
 * This function enables the upper layers set whichband should be selected in the PLL.
 *
 * @param[in] band  The band to be selected.
 *
 * @return The status of the change.
 *
 * @note The caller is responsible for ensuring that the radio no ongoing transactions and
 *  is in the idle state before switching.
 */
xcvrStatus_t XCVR_SetPLLBand(XCVR_BAND_SEL_T band);

/*!
 * @brief Fetches  the current selected band in the PLL.
 *
 * This function enables the upper layers get which frequency band is currently selected.
 *
 * @return The selected band.
 */
XCVR_BAND_SEL_T  XCVR_GetPLLBand(void);

/*!
 * @brief Fetches  the current active data rate for coded Bluetooth LE.
 *
 * This function reads the data rate status for coded operation in Bluetooth LE..
 *
 * @return Returns 1 if the coded data rate is 500Kbps (S2); Returns 0 if the coded data rate is 125Kbps (S8).
 *
 * @warn This routine does not check that coding is active and will return invalid data for non-coded cases. The results from this routine are only
 * valid after the Link Layer hardware has started operation.
 */
uint8_t XCVR_GetCodedDataRate(void);

/*!
 * @brief Controls setting the seed for the MSK to FSK transform in the PHY.
 *
 * This function sets the seed value for the PHY RX MSK twiddle function according to the
 * last bit of the expected preamble.
 *
 * @param[in] last_preamble_bit  The last bit of the preamble (in transmit order).
 *
 * @return The status of the change.
 */
xcvrStatus_t XCVR_SetMSKPreambleSeed(uint8_t last_preamble_bit);



/*! @}*/

/*!
 * @addtogroup xcvr_trim Radio Trim and Test Routines
 * @{
 */

