Jonny-Le/KW47_keylessEntry/libs/middleware/wireless/XCVR/drv/nb2p4ghz/nxp2p4_xcvr.h
/*******************************************************************************
 * Customer level trim functions
 ******************************************************************************/
/*!
 * @brief Controls setting the XTAL trim value.
 *
 * This function enables the upper layers set a crystal trim compensation facor
 *
 * @param[in] xtalTrim  The trim value to apply to the XTAL trimming register. Only the 7 LSB are valid, setting the 8th
 * bit returns an error.
 * @return The status of the trim process.
 */
xcvrStatus_t XCVR_SetXtalTrim(uint8_t xtalTrim);


/*!
 * @brief Controls getting the XTAL trim value.
 *
 * This function enables the upper layers to read the current XTAL compensation factors.
 * The returned value is in the range 0 to 127 (7 bits).
 *
 * @return The XTAL trim compensation factor that is currently programmed.
 */
uint8_t  XCVR_GetXtalTrim(void);

/*!
 * @brief Controls temp compensating the XTAL trim value.
 *
 * This function enables the upper layers set a crystal trim compensation that include temperature compensation.
 *
 * @param[in] temp_comp_lut  The pointer to a LUT for the trim factors across temperature.
 * @param[in] temp_deg_c  The temperature in degrees C.
 * @return The status of the trim process.
 */
xcvrStatus_t XCVR_SetXtalTempComp(const xcvr_temp_comp_lut_t * temp_comp_lut, int16_t temp_deg_c);


/*!
 * @brief  Controls setting the RSSI adjustment.
 *
 * This function enables the upper layers to set an RSSI adjustment value.
 *
 * @param[in] adj  The adjustment value to apply to the RSSI adjustment register. The value must be a signed 8-bit
 * value, in 1/4 dBm step.
 * @return The status of the RSSI adjustment.
 */
xcvrStatus_t XCVR_SetRssiAdjustment(int8_t adj);

/*!
 * @brief  Controls getting the RSSI adjustment.
 *
 * This function enables the upper layers to read the current XCVR RSSI adjustment value.
 *
 * @return The RSSI adjustment value as a signed 8-bit value, representing 1/4 dBm steps..
 */
int8_t  XCVR_GetRssiAdjustment(void);

#if defined(RADIO_IS_GEN_3P5)
/*!
 * @brief  Allows reading an RSSI estimate for the current channel (Wideband).
 *
 * This function enables the upper layers to read the current XCVR RSSI value value.
 *
 * @return The RSSI  value as a signed 8-bit value, representing 1dBm steps..
 * @note This routine forces RX warmup and waits while RSSI is measured before forcing warmdown.
 */
int8_t XCVR_GetInstantRssi(void);
#else
/*!
 * @brief  Allows reading an RSSI estimate for the current channel (Wideband).
 *
 * This function enables the upper layers to read the current XCVR RSSI value value.
 *
 * @return The RSSI  value as a signed 9-bit value (sign extended into 16 bits), representing 1dBm steps..
 * @note This routine forces RX warmup and waits while RSSI is measured before forcing warmdown.
 */
int16_t XCVR_GetInstantRssi(void);
#endif /* defined(RADIO_IS_GEN_3P5) */

/*!
 * @brief  Get the current RSSI value
 *
 * This function retrieves the current RSSI value. If NB_RSSI_AA_MATCH_OVRD_EN is set, the function triggers the
 * RSSI NB measurement and waits until done, else only returns the value triggered by the last packet received.
 *
 * @return The current RSSI value
 */
int16_t XCVR_GetRssiResult(void);

#if defined(RADIO_IS_GEN_3P5) /* Gen 4 and later radios don't include DAC trims */
/*!
 * @brief  Performs the DCOC DAC trim process.
 *
 * This function enables the upper layers to perform the DCOC DAC trim process.
 * The routine stores the results of the trim process at the location pointed to by the input pointer. The contents are
 * invalid in case of error return values.
 *
 * @param[inout] trim_values  Pointer to the location in memory where the routine should store the trim results.
 * @return The status of the trim routine.
 */
xcvrStatus_t XCVR_CalculateDcocDacTrims(xcvr_DcocDacTrim_t * trim_values);

/*!
 * @brief  Controls setting the DCOC DAC trim register contents.
 *
 * This function enables the upper layers to write the current DCOC DAC trim register contents from a structure for
 * usage in initialization of the radio. The routine reads the contents of memory pointed to by the input pointer and
 * applies those values to the trim registers in the radio.
 *
 * @param[in] trim_values  Pointer to the location in memory where the routine should get the trim settngs to be
 * programming into registers.
 * @return The status of the trim setting.
 */
xcvrStatus_t XCVR_SetDcocDacTrims(const xcvr_DcocDacTrim_t * trim_values);

/*!
 * @brief  Controls getting the DCOC DAC trim register contents.
 *
 * This function enables the upper layers to read the current DCOC DAC trim register contents into a structure for
 * storage. The routine reads the trim registers in the radio and writes them out to the location pointed to by the
 * input pointer.
 *
 * @param[inout] trim_values  Pointer to the location in memory where the routine should leave the trim settngs that are
 * read from registers.
 * @return The status of the routine.
 */
xcvrStatus_t XCVR_GetDcocDacTrims(xcvr_DcocDacTrim_t * trim_values);
#endif /* defined(RADIO_IS_GEN_3P5)  */ /* Gen 4 and later radios don't include DAC trims */

/*!
 * @brief Controls setting the PLL to a particular channel using hardware tables.
 *
 * This function enables setting the radio channel for TX and RX. It allows setting the channel based on the hardware
 * channel map tables.
 *
 * @param[in] channel The channel number to set based on protocol specific hardware channel tables.
 * @return The status of the channel over-ride.
 * @note The ::XCVR_ReleasePLLOverride() function must be called to release the PLL over-ride bits which are set by this
 * function. This must be done before any other PLL channel or frequency over-ride function is used OR before the link
 * layer channel control is used.
 */
xcvrStatus_t XCVR_OverrideChannel (uint8_t channel);

/*!
 * @brief Controls setting the PLL to a particular channel using external SW channel table entry.
 *
 * This function enables setting the radio channel for TX and RX. It allows setting the channel based on a software
 * defined table.
 *
 * @param[in] customChannel  If not NULLPTR then this pointer points to a struct containing the integer and numerator
 * values for setting a custom channel.
 * @return The status of the channel over-ride.
 * @note The ::XCVR_ReleasePLLOverride() function must be called to release the PLL over-ride bits which are set by this
 * function. This must be done before any other PLL channel or frequency over-ride function is used OR before the link
 * layer channel control is used.
 */
xcvrStatus_t XCVR_OverrideCustomChannel (const xcvr_pllChannel_t * customChannel);

#if defined(RADIO_IS_GEN_3P5) /* Gen 4 and later radios use low IF receivers and need custom override for RX and TX */
/*!
 * @brief Set an arbitrary frequency for RX and TX for the radio.
 *
 * This function sets the radio frequency used for RX and TX.
 *
 * @param[in] freq  Target frequency setting in Hz.
 * @return Status of the call.
                               * @note The ::XCVR_ReleasePLLOverride() function must be called to release the PLL over-ride bits which are set by this
                               * function. This must be done before                               any other PLL channel or frequency over-ride function is used OR before the link
                               * layer channel control is used.
 */
    xcvrStatus_t XCVR_OverrideFrequency (uint32_t freq);
#else
/*!
 * @brief Set an arbitrary frequency for RX (only) for the radio.
 *
 * This function sets the radio frequency used for RX. It is required due to the use of a low-IF receiver design which
 * requires an offset from the target frequency to be programmed. This routine makes use of the
 * ::XCVR_OverrideTxFrequency() routine for common functionality.
 *
 * @param[in] freq  Target frequency setting in Hz.
 * @param[in] offset_freq An offset to be applied to the target frequency to either set the RF Intermediate Frequency
 * (IF) or, in special cases, to set both the IF and a much larger offset. Typically this offset should be 1MHz
 * or 1.5MHz. A value of zero will return an error because RX would fail.
 * @return Status of the call.
 * @note The ::XCVR_ReleasePLLOverride() function must be called to release the PLL over-ride bits which are set by this
 * function. This must be done before any other PLL channel or frequency over-ride function is used OR before the link
 * layer channel control is used.
 */
xcvrStatus_t XCVR_OverrideRxFrequency (uint32_t freq, int32_t offset_freq);

/*!
 * @brief Set an arbitrary frequency for TX (only) for the radio.
 *
 * This function sets the radio frequency used for TX. It does not work for RX frequency setting due to the use of a
 * low-IF receiver design which requires an offset from the target frequency to be programmed.
 *
 * @param[in] freq  Target frequency setting in Hz.
 * @return Status of the call.
 * @note The ::XCVR_ReleasePLLOverride() function must be called to release the PLL over-ride bits which are set by this
 * function. This must be done before any other PLL channel or frequency over-ride function is used OR before the link
 * layer channel control is used.
 */
xcvrStatus_t XCVR_OverrideTxFrequency (uint32_t freq);
#endif /* defined(RADIO_IS_GEN_3P5)*/

/*!
 * @brief Releases any PLL channel/frequency over-rides.
 *
 * This function releases any over-rides controlling the PLL frequency and returns the PLL to Link Layer control. It
 * releases the overrides set by
 * ::XCVR_OverrideChannel, ::XCVR_OverrideCustomChannel, ::XCVR_OverrideRxFrequency, or ::XCVR_OverrideTxFrequency.
 *
 * @note This function must be called in between any mix of ::XCVR_OverrideChannel, ::XCVR_OverrideCustomChannel,
 * ::XCVR_OverrideRxFrequency, ::XCVR_OverrideTxFrequency usages. It must also be called in between any of these
 * override functions and link layerchannel register usage.
 */
void XCVR_ReleasePLLOverride(void);

#if defined(RADIO_IS_GEN_3P5) /* Gen 4 and later radios use low IF receivers and need custom override for RX and TX */
/*!
 * @brief Reads the current frequency for RX and TX for the radio.
 *
 * This function reads the radio frequency used for RX and TX.
 *
 * @return Current radio frequency setting in Hz.
 */
 #else
 /*!
  * @brief Reads the current frequency for RX and TX for the radio.
  *
  * This function reads the radio frequency used for RX and TX.
  *
  * @return Current radio frequency setting in Hz.
 * @note If the frequency was set using ::XCVR_OverrideRxFrequency() then this routine returns the sum of the target and
 * offset frequencies.
  */
#endif /* defined(RADIO_IS_GEN_3P5)*/
uint32_t XCVR_GetFreq ( void );


/*!
 * @brief Force receiver warmup.
 *
 * This function forces the initiation of a receiver warmup sequence.
 *
 */
void XCVR_ForceRxWu ( void );


/*!
 * @brief Force receiver warmdown.
 *
 * This function forces the initiation of a receiver warmdown sequence.
 *
 */
void XCVR_ForceRxWd ( void );


/*!
 * @brief Force transmitter warmup.
 *
 * This function forces the initiation of a transmit warmup sequence.
 *
 */
void XCVR_ForceTxWu ( void );


/*!
 * @brief Force transmitter warmdown.
 *
 * This function forces the initiation of a transmit warmdown sequence.
 *
 */
void XCVR_ForceTxWd ( void );

/*!
 * @brief Wait (poll) for completion of receiver warmup.
 *
 * This function polls for the TSM to complete a  receive warmup sequence.
 *
 */
void XCVR_WaitRxWu ( void );

/*!
 * @brief Wait (poll) for completion of transmitter warmup.
 *
 * This function polls for the TSM to complete a  transmit warmup sequence.
 *
 */
void XCVR_WaitTxWu ( void );

/*!
 * @brief Wait (poll) for completion of transmitter or receiver warmdown.
 *
 * This function polls for the TSM to enter IDLE state after a RX or TX warmdown.
 *
 */
void XCVR_WaitRxTxWd(void);

/*!
 * @brief Starts transmit with a TX pattern register data sequence.
 *
 * This function starts transmitting using the DFT pattern register mode.
 *
 * @param[in] channel_num  The protocol specific channel to transmit on. Valid values are defined in the CHANNEL_NUM
 * register documentation.
 * @param[in] xcvr_config  Pointer to a pointer to the complete radio settings structure.
 * @param[in] rbme_config  Pointer to a pointer to the RBME settings structure for coding, CRC, whitening setup.
 * @param[in] tx_pattern   The data pattern to transmit.
 * @return The status of the pattern reg transmit.
 * @note The XCVR_DftTxOff() function must be called to turn off TX and revert all settings. This routine calls
 * XCVR_ChangeMode() with the desired radio mode and data rate.
 */
xcvrStatus_t XCVR_DftTxPatternReg(uint8_t channel_num,
                                  const xcvr_config_t **xcvr_config,
                                  const xcvr_coding_config_t **rbme_config,
                                  uint32_t tx_pattern);

/*!
 * @brief Starts transmit with a TX LFSR register data sequence.
 *
 * This function starts transmitting using the DFT LFSR register mode.
 *
 * @param[in] channel_num  The protocol specific channel to transmit on. Valid values are defined in the CHANNEL_NUM
 * register documentation.
 * @param[in] xcvr_config  Pointer to a pointer to the complete radio settings structure.
 * @param[in] rbme_config  Pointer to a pointer to the RBME settings structure for coding, CRC, whitening setup.
 * @param[in] lfsr_length  The length of the LFSR sequence to use.
 * @return The status of the LFSR reg transmit.
 * @note The XCVR_DftTxOff() function must be called to turn off TX and revert all settings. This routine calls
 * XCVR_ChangeMode() with the desired radio configuration.
 */
xcvrStatus_t XCVR_DftTxLfsrReg(uint8_t channel_num,
                               const xcvr_config_t **xcvr_config,
                               const xcvr_coding_config_t **rbme_config,
                               uint8_t lfsr_length);

/*!
 * @brief Controls clearing all TX DFT settings.
 *
 * This function reverts all TX DFT settings from the test modes to normal operating mode.
 *
 */
void XCVR_DftTxOff(void);

/*!
 * @brief Controls a forced setting of the PA power level.
 *
 * This function enables setting the PA power level to a specific setting, overriding any link layer settings.
 *
 * @param[in] pa_power  The power level to set. Valid values are 0, 1, and even values from 2 to 0x3E, inclusive.
 * @return The status of the PA power over-ride.
 */
xcvrStatus_t XCVR_ForcePAPower(uint8_t pa_power);

/*!
 * @brief Controls releasing any forced setting of the PA power level.
 *
 * This function releases the forced setting of the PA power level returning control to the link layer settings.
 *
 */
void XCVR_ReleasePAPower(void);


/*!
 * @brief Starts CW TX.
 *
 * This function starts transmitting CW (no modulation).
 *
 * @param[in] rf_freq  The RF frequency to transmit on in Hz. Valid values are integer values from 2,360,000 to
 * 2,487,000Hz, inclusive.
 *
 * @return The status of the CW transmit.
 */
xcvrStatus_t XCVR_DftTxCW(uint32_t rf_freq);

#if defined(NXP_RADIO_GEN) && (NXP_RADIO_GEN >= 470)
/*!
 * @brief Function to enable Analog PA ramping instead of digital ramping.
 *
 * This function enables Analog PA ramping to provide smoother ramp with fewer transients.
 *
 * @param[in] smoother_cur  The current value for the PA slope. Speed of the analog ramping is inverselly
 *  proportional to the register value (higher value == slower ramp).
 *
 * @return The status of the analog ramping enable.
 */
xcvrStatus_t XCVR_EnableAnaPaRamp(uint8_t smoother_cur);


/*!
 * @brief Function to disable Analog PA ramping and return to prior settings.
 *
 * This function disables Analog PA ramping and restores the settings to those prior to ::XCVR_EnableAnaPaRamp().
 *
 * @pre  The function ::XCVR_EnableAnaPaRamp() must have been called first in order to backup the 
 *  settings in the affected registers.
 *
 */
void XCVR_DisableAnaPaRamp(void);
#endif  /* defined(NXP_RADIO_GEN) && (NXP_RADIO_GEN >= 470) */



/*!
 * @brief Function to set AGC to manual and DCOC to auto.
 *
 * This function sets full manual control of AGC and allows DCOC automatic processing to operate normally.
 *
 * @param[in] man_agc_idx  The desired manual AGC index to use (26 to 0).
 * @post
 *    This function disables AGC as a side effect.
 */
xcvrStatus_t XCVR_SetManAgc(uint8_t man_agc_idx);

/*!
 * @brief Function to clear AGC manual operation.
 *
 * This function clears AGC manual mode and allows AGC and DCOC automatic processing to operate normally.
 *
 * @post
 *    This function leaves AGC enabled!
 */
void XCVR_ClearManAgc(void);

/*!
 * @brief Function to set RCCAL to a manual value.
 *
 * This function sets full manual control of RCCAL.
 *
 * @param[in] man_rccal_val  The desired manual RCCAL value to use (< 0x1F).
 *
 * @return The status of the manual RCCAL enable.
 */
xcvrStatus_t XCVR_SetManRCcal(uint8_t man_rccal_val);

/*!
 * @brief Function to release RCCAL manual setting.
 *
 * This function clears the enable for manual RCCAL application and allows RCCAL automatic processing to operate normally.
 *
 */
 void XCVR_ReleaseManRCcal(void);


/*!
 * @brief Function to set PA power bump to higher power level.
 *
 * This function sets the XCVR LDO registers required to support high power PA operation.
 *
 * @note
 *    The power increase requires DCDC voltage to be increased as well. This is NOT done by the XCVR driver.
 */
void XCVR_bumpPaPowerUp(void);

/*!
 * @brief Function to return PA power bump to the default power level.
 *
 * This function sets the XCVR LDO registers back to the default power level for PA operation.
 *
 * @note
 *    The power level change requires DCDC voltage to be changed as well. This is NOT done by the XCVR driver.
 */
 void XCVR_releasePaPowerBump(void);

/*!
 * @brief Fetches the radio version for this silicon.
 *
 * This function reads the RADIO_VER field and returns an enumeration based on that value.
 *
 * @return The radio version of the silicon.
 */
uint16_t XCVR_ReadRadioVer(void);

#ifdef GCOV_DO_COVERAGE /* routine is local except when testing code coverage */
link_layer_t map_mode_to_ll(radio_mode_t mode);
uint16_t XCVR_IdentifyRadioVer(uint32_t radio_ver);
#endif /* !defined(GCOV_DO_COVERAGE) */

/*!
 * @brief Function to override the TX filter to reduce sideband power during TX.
 *
 * This function overrides the TX filter settings for 802.15.4 mode and is intended to be used when transmitting on 
 * channel 11 or 26 at power levels > 0dB. It allows the system to meet regulatory lower/upper band power limits.
 *
 * @param[in] level  The level of filtering to apply 0 through 4 are valid; Zero means release all filtering, 1 - 4 are
 * increasing levels of filtering.
 *
 * @return The status of the filter configuration.
 *
 * @note Increasing levels of filtering have the trade-off of increasing the TX EVM.
 */
xcvrStatus_t XCVR_802p15p4_TxRegulatory(uint8_t level);

#if defined(NXP_RADIO_GEN) && (NXP_RADIO_GEN >= 400)
/*!
 * @brief Function to override the LDO ANT to force it enabled. It also clears the HiZ setting for LDO_ANT.
 *
 * This function overrides the LDO_ANT regulator to be enabled in order to reduce peaks in current drain for repeated
 * on/off cycles of the LDO_ANT.
 *
 * @note This routine also disables the HiZ mode of LDO_ANT. The XCVR_setLdoAntHiz() function is used to enable HiZ and
 * disable the LDO_ANT override settings.
 */
void XCVR_forceLdoAntEnable(void);

/*!
 * @brief Function to release the overrides for the LDO ANT and enable the HiZ mode.
 *
 * This function releases the overrides the LDO_ANT regulator and enables the HiZ mode. This prevents the discharge of
 * the large capacitor connected to the ouputs of the LDO_ANT.
 *
 * @note This routine also enables the HiZ mode of LDO_ANT. The XCVR_forceLdoAntEnable() function is used to disable HiZ
 * and set the LDO_ANT override settings.
 */
void XCVR_setLdoAntHiz(void);

/*!
 * @brief Function to release the overrides for the LDO ANT *and* release the HiZ mode.
 *
 * This function releases the overrides the LDO_ANT regulator and releases the HiZ mode. This returns the state of the
 * XCVR to it's default state of neither LDO_ANT overridden nor HiZ mode enabled.
 *
 * @note This routine is used to revert the effects of either of the XCVR_forceLdoAntEnable() or XCVR_setLdoAntHiz()
 * APIs and put the XCVR back to a default state for the override and HiZ settings.
 */
void XCVR_releaseLdoAntAll(void);

/*!
 * @brief Function to set LDO ANT TRIM value.
 *
 * This function set LDO_ANT_TRIM value only if receives valid input parameters.
 * It first check if input parameter ucLdoAntTrimValue has valid value and if yes it set into XCVR register.
 *
 * @param[in] ucLdoAntTrimValue Valid values: 0x00 - 0x0F.
 *
 * @return gXcvrSuccess_c - if setting is valid and has been applied
 *         gXcvrInvalidParameters_c - if setting is not valid and has not been applied
 *
 * @note This routine is used by Link Layers which needs to change LDO_ANT_TRIM value according with their needs
 */
xcvrStatus_t XCVR_setLdoAntTrim(uint8_t ucLdoAntTrimValue);

/*!
 * @brief Function to get actual LDO ANT TRIM value.
 *
 * This function get actual LDO_ANT_TRIM value from XCVR LDO_1 register.
 *
 * @return LDO_ANT_TRIM register settings value
 *
 * @note This routine is used by Link Layers which needs to check LDO_ANT_TRIM value
 */
uint8_t XCVR_getLdoAntTrim(void);
#endif /* defined(NXP_RADIO_GEN) && (NXP_RADIO_GEN >= 400) */

#if defined(NXP_RADIO_GEN) && (NXP_RADIO_GEN >= 470)
/*!
 * @brief Function to trigger start of a fast DMA upload/download of peripheral registers.
 *
 * This function performs a fast DMA download from a set of peripheral registers, based on a descriptor, to an area of
 * PKT RAM memory. It is intended to support fast switchover between RSM (Chanel Sounding) operations and Bluetooth
 * operations..
 *
 * @param[in] pkt_ram_sel  The bank of PKT RAM to use; Zero means use TX PKT_RAM; 1 means use RX PKT_RAM.
 * @param[in] offset_in_pkt_ram  The 32bit word offset within the chosen PKT_RAM bank where the descriptors start.
 * @param[in] upload  If true, the desired function is upload to registers, if false, then download.
 *
 * @pre The descriptors must be loaded into the desired PKT_RAM bank at the specified offset prior to running this
 * routine.
 *
 * @warning This routine does NOT have the ability to check if the descriptors are configured correctly and can produce 
 * unexpected results if the descriptors overrun the targeted PKT_RAM space.
 */
void XCVR_FastPeriphReg_UpDownload_Go(PKT_RAM_BANK_SEL_T pkt_ram_sel, uint32_t offset_in_pkt_ram, bool upload);

