Jonny-Le/KW47_keylessEntry/libs/middleware/wireless/XCVR/drv/nb2p4ghz/nxp2p4_xcvr.h
/*!
 * @brief Function to load a compressed list of descriptors for fast DMA download of peripheral registers.
 *
 * This function loads a compressed list of descriptors to an area of PKT RAM memory with the proper spacing to allow
 * for the data storage in between each descriptor (after download is complete). The compressed aspect means that the
 * descriptors are passed in as a list with no data spacing in between them.
 * This routine is intended to be used before XCVR_FastPeriphReg_UpDownload() with the upload parameter set to false.
 *
 * @param[in] descriptor_list  Pointer to the list of descriptors to be placed into PKT_RAM.
 * @param[in] num_descrips  The number of descriptors to be loaded..
 * @param[in] pkt_ram_mem_ptr  Pointer to a location in one of the PKT RAM spaces where descriptors/data will be loaded.
 *
 * @return The status of the descriptor load to PKT_RAM.
 *
 * @post The descriptors will be loaded into the desired PKT_RAM bank at the specified offset with spacing in between
 * them and with a single word of all zeros as the end to indicate the completion of the list.
 *
 * @note The XCVR_ValidateFastPeriphDescrip() or other means must be used to validate the input date before calling this
 * routine because overflow protection is not included. The intent is that static data structures can be checked once
 * and then subsequent checks can be omitted. Dynamic descriptor structures must be checked every time.
 */
xcvrStatus_t XCVR_FastPeriphDescrip_Load(const uint32_t *descriptor_list,
                                         uint16_t num_descrips,
                                         volatile uint32_t *pkt_ram_mem_ptr);

/*!
 * @brief Function to load a list of descriptors and data for fast DMA upload of peripheral registers.
 *
 * This function loads a list of mixed descriptors and data to an area of PKT RAM memory for use with
 * XCVR_FastPeriphReg_UpDownload() when a fresh set of data is being uploaded to peripheral registers.
 *
 * @param[in] descriptor_data_list  Pointer to the list of descriptors and data (mixed) to be placed into PKT_RAM.
 * @param[in] total_words_to_load  The number of words in the above mixed list to be loaded. Does not include the
 * trailing zero required to end the list.
 * @param[in] pkt_ram_mem_ptr  Pointer to a location in one of the PKT RAM spaces where descriptors/data will be loaded.
 *
 * @return The status of the descriptor and data load to PKT_RAM.
 *
 * @post The descriptors and data will be loaded into the desired PKT_RAM bank at the specified offset 
 * and a single word of all zeros will be added to the end to indicate the completion of the list.
 *
 * @note The XCVR_ValidateFastPeriphDescrip() or other means must be used to validate the input date before calling this
 * routine because overflow protection is not included. The intent is that static data structures can be checked once
 * and then subsequent checks can be omitted. Dynamic descriptor structures must be checked every time.
 */
xcvrStatus_t XCVR_FastPeriphDescripData_Load(uint32_t *descriptor_data_list,
                                             uint16_t total_words_to_load,
                                             volatile uint32_t *pkt_ram_mem_ptr);

/*!
 * @brief Function to validate a descriptor list for fast DMA upload/download of peripheral registers.
 *
 * This function validates a descriptor list to be used in the fast DMA upload or download functionality. It 
 * requires that the  XCVR_FastPeriphDescrip_WordCount() routine first be used to calculate the word count.
 *
 * @param[in] pkt_ram_sel  The bank of PKT RAM to use; Zero means use TX PKT_RAM; 1 means use RX PKT_RAM.
 * @param[in] offset_in_pkt_ram  The 32bit word offset within the chosen PKT_RAM bank where the descriptors should
 * start.
 * @param[in] descriptor_data_list  Pointer to the list of descriptors to be placed into PKT_RAM.
 * @param[in] num_descrips  The number of descriptors to be loaded..
 * @param[in] compressed_list  If true, the desired list only contains descriptors and not data. If false, list is both
 * descriptors and register data.
 * @param[out] pkt_ram_mem_ptr  Pointer to a location in one of the PKT RAM spaces where subsequent routines will load
 * descriptors/data. Invalid if status return is not success.
 *
 * @return The status of the descriptor validation.
 */
xcvrStatus_t XCVR_ValidateFastPeriphDescrip(PKT_RAM_BANK_SEL_T pkt_ram_sel,
                                            uint32_t offset_in_pkt_ram,
                                            uint32_t *descriptor_data_list,
                                            uint16_t num_descrips,
                                            bool compressed_list,
                                            volatile uint32_t **pkt_ram_mem_ptr);

/*!
 * @brief Function to count the number of words occupied by descriptors and register data.
 *
 * This function takes in a set of descriptors and counts the total number of words occupied by the set of descriptors
 * and register data. It is used to verify sufficient PKT RAM is available..
 *
 * @param[in] descriptor_list  Pointer to the list of descriptors to be placed into PKT_RAM.
 * @param[in] num_descrips  The number of descriptors to be loaded..
 * @param[in] compressed_list  If true, the desired list only contains descriptors and not data. If false, list is both
 * descriptors and register data.
 *
 * @return Thenumber of words it will occupy in PKT RAM.
 */
 uint32_t  XCVR_FastPeriphDescrip_WordCount(uint32_t * descriptor_list, uint16_t num_descrips , bool compressed_list);

/*!
 * @brief Function towait for completion of a FastPeriph to IPS upload or download.
 *
 * This function waits for completion of a Fast Peripheral to IPS upload or download. It completes if the function is
 * not enabled or if the function is enabled AND the status bit indicates completion of the activities.
 *
 * @return False if an error is asserted at completion of the transfer; True if the error bit is clear.
 *
 * @post The enable bit for the FastPeriph function is cleared by this routine so it will be ready for subsequent usage. 
 */
bool XCVR_FastPeriph_WaitComplete(void);

/*!
 * @brief Function to check for completion and no error of a FastPeriph to IPS upload or download.
 *
 * This function read status for completion of a Fast Peripheral to IPS upload or download. It simply indicates the
 * state of the DONE and ERROR bits.
 *
 * @return False if an error is asserted or the transfer has not completed; True if the error bit is clear and the
 * transfer has completed.
 *
 * @warn The initial KW47 implementation does NOT support polling of the completion bits, the calling function must only
 * call this routine AFTER the DMA backup is completed. If it is called during the DMA transfers then there may be bus
 * conflicts which can corrupt the transfer (and corruption must be assumed).
 */
bool XCVR_FastPeriph_CheckErrorComplete(void);

/*!
 * @brief Function to snapshot or restore XCVR registers to a storage structure in PKT RAM using fast IPS
 * DMA.
 *
 * This function captures or restores the state of the XCVR registers with a fast DMA block storing to one of the
 * PKT RAM banks. It is used to quickly backup and restore XCVR registers without the slow access time penalty for normal
 * XCVR register accesses.
 *
 * @param desc_ptr pointer to the descriptor structure describing the sequences of registers to backup to PKT RAM.
 * @param num_entries Number of entries in the desciptor structure, not including the zero ending descriptor.
 * @param pkt_ram_bank Selects the TX or RX packet RAM bank to use for storage of the download.
 * @param pkt_ram_index_offset The word offset into the PKT RAM bank where the descriptors should be loaded and the
 * register backup stored.
 * @param restore If set to true then restore from PKT RAM is done. Otherwise, backup is to PKT RAM done.
 *
 * @return The status of the XCVR fast backup process.
 *
 * @pre The caller must have called the XCVR_ValidateFastPeriphDescrip() routine to validate the descriptor structure is
 * correct and PKT RAM limits are not exceeded. The function XCVR_FastPeriphDescrip_WordCount() can be used to get the
 * word count that will be used in the PKT RAM for storage of the data.
 *
 */
xcvrStatus_t XCVR_FastBackupRestore(const uint32_t *desc_ptr,
                                    uint8_t num_entries,
                                    PKT_RAM_BANK_SEL_T pkt_ram_bank,
                                    uint16_t pkt_ram_index_offset,
                                    bool restore);

#if defined(SAVE_RESTORE_15P4)

#define XCVR_15P4_BACKUP_DESC_SIZE      11U

extern uint32_t xcvr_15p4_backup_descriptors[XCVR_15P4_BACKUP_DESC_SIZE];

void XCVR_Create15p4BackupDescriptors();

#endif

#if defined(SAVE_RESTORE_BLE)

#define XCVR_BLE_BACKUP_DESC_SIZE       11U

extern uint32_t xcvr_ble_backup_descriptors[XCVR_BLE_BACKUP_DESC_SIZE];

void XCVR_CreateBleBackupDescriptors();

#endif

/*!
 * @brief Function to backup the XCVR LIF and RBME registers to the TX_PACKET_RAM using the fast IPS DMA.
 *
 * The function XCVR_FastPeriph_WaitComplete() can be used to ensure the DMA transfer is complete.
 *
 * @return The status of the XCVR fast backup process.
 */
xcvrStatus_t XCVR_LIF_RBME_Backup(void);

/*!
 * @brief Function to restore the XCVR LIF and RBME registers from the TX_PACKET_RAM using the fast IPS DMA.
 *
 * The function XCVR_FastPeriph_WaitComplete() can be used to ensure the DMA transfer is complete.
 *
 * @return The status of the XCVR fast backup process.
 */
xcvrStatus_t XCVR_LIF_RBME_Restore(void);

#endif /* defined(NXP_RADIO_GEN) && (NXP_RADIO_GEN >= 470) */


/*! @}*/

#if defined(__cplusplus)
}
#endif


#endif /* NB2P4_XCVR_H */
